--Задание
--В конце года цену всех книг на складе пересчитывают – снижают ее на 30%. Написать SQL запрос, который из таблицы book выбирает названия, авторов, количества и вычисляет новые цены книг. Столбец с новой ценой назвать new_price, цену округлить до 2-х знаков после запятой.
--
--Результат:
--
--+-----------------------+------------------+--------+-----------+
--| title                 | author           | amount | new_price |
--+-----------------------+------------------+--------+-----------+
--| Мастер и Маргарита    | Булгаков М.А.    | 3      | 469.69    |
--| Белая гвардия         | Булгаков М.А.    | 5      | 378.35    |
--| Идиот                 | Достоевский Ф.М. | 10     | 322.00    |
--| Братья Карамазовы     | Достоевский Ф.М. | 2      | 559.31    |
--| Стихотворения и поэмы | Есенин С.А.      | 15     | 455.00    |
--+-----------------------+------------------+--------+-----------+
--
--Структура и наполнение таблицы book:
--+---------+-----------------------+------------------+--------+--------+
--| book_id | title                 | author           | price  | amount |
--+---------+-----------------------+------------------+--------+--------+
--| 1       | Мастер и Маргарита    | Булгаков М.А.    | 670.99 | 3      |
--| 2       | Белая гвардия         | Булгаков М.А.    | 540.50 | 5      |
--| 3       | Идиот                 | Достоевский Ф.М. | 460.00 | 10     |
--| 4       | Братья Карамазовы     | Достоевский Ф.М. | 799.01 | 2      |
--| 5       | Стихотворения и поэмы | Есенин С.А.      | 650.00 | 15     |
--+---------+-----------------------+------------------+--------+--------+


SELECT title, author, amount, ROUND(price - (price*(30/100)),2) AS new_price FROM book;